#+TITLE: Test Writing Flow
#+AUTHOR: ii team
#+TODO: TODO(t) NEXT(n) IN-PROGRESS(i) BLOCKED(b) | DONE(d)
#+OPTIONS: toc:nil tags:nil todo:nil
#+EXPORT_SELECT_TAGS: export
** DONE Grab cluster info, to ensure it is up.
   
   #+BEGIN_SRC shell :results replace 
     kubectl cluster-info
   #+END_SRC

   #+RESULTS:
   #+begin_EXAMPLE
   Kubernetes master is running at https://127.0.0.1:37015
   KubeDNS is running at https://127.0.0.1:37015/api/v1/namespaces/kube-system/services/kube-dns:dns/proxy

   To further debug and diagnose cluster problems, use 'kubectl cluster-info dump'.
   #+end_EXAMPLE

*** check
   #+begin_src shell :eval never-export :exports both
     #ps ax | grep kind\ load | grep -v grep
     docker exec kind-control-plane crictl img
   #+end_src

  #+RESULTS:
  #+begin_EXAMPLE
  IMAGE                                TAG                 IMAGE ID            SIZE
  docker.io/kindest/kindnetd           0.5.3               aa67fec7d7ef7       80.3MB
  docker.io/raiinbow/hasura            2019-12-03-16-31    a6d3afa615805       53.1MB
  docker.io/raiinbow/postgres          2019-12-03-14-19    e712ce7cc2a67       1.2GB
  k8s.gcr.io/coredns                   1.6.2               bf261d1579144       44.2MB
  k8s.gcr.io/etcd                      3.3.15-0            b2756210eeabf       248MB
  k8s.gcr.io/kube-apiserver            v1.16.3             392249bd86967       185MB
  k8s.gcr.io/kube-controller-manager   v1.16.3             808025b3748ef       128MB
  k8s.gcr.io/kube-proxy                v1.16.3             f4fd1d7052b4e       103MB
  k8s.gcr.io/kube-scheduler            v1.16.3             1974a03197540       105MB
  k8s.gcr.io/pause                     3.1                 da86e6ba6ca19       746kB
  #+end_EXAMPLE

** DONE Check on cluster
#+begin_src shell :eval never-export :exports both
docker exec kind-control-plane crictl ps 
#+end_src

#+RESULTS:
#+begin_EXAMPLE
CONTAINER           IMAGE               CREATED             STATE               NAME                      ATTEMPT             POD ID
adae42c6657bf       bf261d1579144       8 seconds ago       Running             coredns                   0                   45ade81123bb6
f31afbabe238b       bf261d1579144       8 seconds ago       Running             coredns                   0                   b9a4a19714e98
ec7d93d0d7ba0       f4fd1d7052b4e       21 seconds ago      Running             kube-proxy                0                   1e6ff85f22919
38f9df4ecbd3e       aa67fec7d7ef7       21 seconds ago      Running             kindnet-cni               0                   abf00a446c383
fe56ba6568ec5       b2756210eeabf       45 seconds ago      Running             etcd                      0                   efa35b9112c9a
9ddc803fe7a52       392249bd86967       45 seconds ago      Running             kube-apiserver            0                   de7f037aa462f
49b8133b4d89d       808025b3748ef       45 seconds ago      Running             kube-controller-manager   0                   d879349cd7a00
d8ca66c768b8c       1974a03197540       45 seconds ago      Running             kube-scheduler            0                   314cde7e9acc5
#+end_EXAMPLE

** DONE Verify Pods Running
   #+begin_src shell
     kubectl get pods --all-namespaces
   #+end_src

   #+RESULTS:
   #+begin_EXAMPLE
   NAMESPACE     NAME                                         READY   STATUS    RESTARTS   AGE
   default       apisnoop-auditlogger-6458f9545-hgrgf         1/1     Running   0          70s
   default       hasura-5d447cc65d-w42n5                      1/1     Running   0          70s
   default       postgres-7b494768d5-2h28g                    1/1     Running   0          70s
   kube-system   coredns-5644d7b6d9-hq5js                     1/1     Running   0          114s
   kube-system   coredns-5644d7b6d9-qr4bc                     1/1     Running   0          114s
   kube-system   etcd-kind-control-plane                      1/1     Running   0          45s
   kube-system   kindnet-nrhjz                                1/1     Running   0          114s
   kube-system   kube-apiserver-kind-control-plane            1/1     Running   0          67s
   kube-system   kube-controller-manager-kind-control-plane   1/1     Running   0          46s
   kube-system   kube-proxy-297gd                             1/1     Running   0          114s
   kube-system   kube-scheduler-kind-control-plane            1/1     Running   0          46s
   #+end_EXAMPLE
** Example in Go

   #+begin_src shell
     go get -v -u k8s.io/apimachinery/pkg/apis/meta/v1
     go get -v -u k8s.io/client-go/kubernetes
     go get -v -u k8s.io/client-go/tools/clientcmd
   #+end_src

   #+begin_src go
     package main

     import (
       "fmt"
       "flag"
       "os"
       //"encoding/json"
       v1 "k8s.io/api/core/v1"
       metav1 "k8s.io/apimachinery/pkg/apis/meta/v1"
       "k8s.io/client-go/kubernetes"
       "k8s.io/client-go/tools/clientcmd"
       "k8s.io/apimachinery/pkg/types"
     )

     func main() {
       // uses the current context in kubeconfig
       kubeconfig := flag.String("kubeconfig", fmt.Sprintf("%v/%v/%v", os.Getenv("HOME"), ".kube", "config"), "(optional) absolute path to the kubeconfig file")
          flag.Parse()
       config, err := clientcmd.BuildConfigFromFlags("", *kubeconfig)
       if err != nil {
         fmt.Println(err)
         return
       }
       // make our work easier to find in the audit_event queries
       config.UserAgent = "live-test-writing"
       // creates the clientset
       clientset, _ := kubernetes.NewForConfig(config)

       podTemplateName := "nginx-pod-template"

       // get a list of PodTemplates
       podTemplateList, err := clientset.CoreV1().PodTemplates("").List(metav1.ListOptions{})
       if err != nil {
         fmt.Println("[error]", err)
         return
       }
       if len(podTemplateList.Items) > 0 {
         fmt.Println("[error] templates should not be populated")
         return
       }

       fmt.Println("[status] no PodTemplates found")

       // create a PodTemplate
       _, err = clientset.CoreV1().PodTemplates("default").Create(&v1.PodTemplate{
         ObjectMeta: metav1.ObjectMeta{
           Name: podTemplateName,
         },
         Template: v1.PodTemplateSpec{
           Spec: v1.PodSpec{
             Containers: []v1.Container{
               {Name: "nginx", Image: "nginx"},
             },
           },
         },
       })
       if err != nil {
         fmt.Println("[error]", err)
         return
       }

       fmt.Println("[status] PodTemplate created")

       // get template
       podTemplateRead, err := clientset.CoreV1().PodTemplates("default").Get(podTemplateName, metav1.GetOptions{})
       if err != nil {
         fmt.Println("[error]", err)
         return
       }
       if podTemplateRead.ObjectMeta.Name != podTemplateName {
         fmt.Println("[error] PodTemplate name doesn't match")
         return
       }

       fmt.Println("[status] found created PodTemplate")

       // patch template
       PodTemplatePatch := fmt.Sprintf(`{"metadata":{"labels":{"a":"1"}}}`)
       _, err = clientset.CoreV1().PodTemplates("default").Patch(podTemplateName, types.StrategicMergePatchType, []byte(PodTemplatePatch))
       if err != nil {
         fmt.Println("[error]", err)
         return
       }

       fmt.Println("[status] patched PodTemplate with label a=1")

       // get template (ensure label is there)
       podTemplateRead, err = clientset.CoreV1().PodTemplates("default").Get(podTemplateName, metav1.GetOptions{})
       if err != nil {
         fmt.Println("[error]", err)
         return
       }
       if podTemplateRead.ObjectMeta.Labels["a"] != "1" {
         fmt.Println("[error] template doesn't contain the label a=1")
         return
       }

       fmt.Println("[status] found label on PodTemplate")

       // list PodTemplates on all namespaces by label a=1
       podTemplateListWithLabel, err := clientset.CoreV1().PodTemplates("").List(metav1.ListOptions{
         LabelSelector: "a=1",
       })
       if err != nil {
         fmt.Println("[error]", err)
         return
       }
       foundPodTemplateWithLabel := false
       for _, podTemplate := range podTemplateListWithLabel.Items {
         if podTemplate.ObjectMeta.Name == podTemplateName && podTemplate.ObjectMeta.Labels["a"] == "1" {
           foundPodTemplateWithLabel = true
         }
       }
       if foundPodTemplateWithLabel == false || len(podTemplateListWithLabel.Items) == 0 {
         fmt.Println("[error] PodTemplate doesn't contain the label")
         return
       }

       fmt.Println("[status] found PodTemplate by label")

       err = clientset.CoreV1().PodTemplates("default").Delete(podTemplateName, &metav1.DeleteOptions{})
       if err != nil {
         fmt.Println("[error]", err)
         return
       }

       fmt.Println("[status] deleted PodTemplate")

       podTemplateListWithLabel, err = clientset.CoreV1().PodTemplates("").List(metav1.ListOptions{
         LabelSelector: "a=1",
       })
       if err != nil {
         fmt.Println("[error]", err)
         return
       }
       if len(podTemplateListWithLabel.Items) > 0 {
         fmt.Println("[error] list returned a PodTemplate matching the requested labels")
         return
       }

       fmt.Println("[status] no PodTemplates found")

       fmt.Println("[status] complete")
     }
   #+end_src

   #+RESULTS:
   : [status] no PodTemplates found
   : [status] PodTemplate created
   : [status] found created PodTemplate
   : [status] patched PodTemplate with label a=1
   : [status] found label on PodTemplate
   : [status] found PodTemplate by label
   : [status] deleted PodTemplate
   : [status] no PodTemplates found
   : [status] complete

*** 470: PodSpec Field Report View
    :PROPERTIES:
    :header-args:sql-mode+: :tangle ../apps/hasura/migrations/470_view_podspec_field_report.up.sql
    :END:
 #+NAME: podspec_field_hits
 #+BEGIN_SRC sql-mode
   create or replace view podspec_field_report as
   select distinct podspec_field,
         sum(other_hits) as other_hits,
         sum(e2e_hits) as e2e_hits,
         sum(conf_hits) as conf_hits,
         release,
         deprecated,
         gated,
         required,
         field_kind,
         field_type,
         bucket,
         job
   from podspec_field_mid_report
   group by podspec_field, release, deprecated, gated, required, field_kind, field_type, bucket, job
   order by conf_hits, e2e_hits, other_hits;
 #+END_SRC
 
 #+BEGIN_SRC sql-mode :results replace drawer
   select
     podspec_field, e2e_hits, pfr.job, bjs.job_timestamp
     from podspec_field_report pfr
     JOIN bucket_job_swagger bjs on(bjs.bucket = pfr.bucket AND bjs.job = pfr.job) 
    order by podspec_field;
 #+END_SRC

 #+RESULTS:
 :results:
          podspec_field         | e2e_hits |         job         |    job_timestamp    
 -------------------------------+----------+---------------------+---------------------
  activeDeadlineSeconds         |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  activeDeadlineSeconds         |        0 | live                | 2019-12-04 20:14:50
  affinity                      |        0 | live                | 2019-12-04 20:14:50
  affinity                      |     2264 | 1202311785298792448 | 2019-12-04 20:14:50
  automountServiceAccountToken  |      184 | 1202311785298792448 | 2019-12-04 20:14:50
  automountServiceAccountToken  |        0 | live                | 2019-12-04 20:14:50
  containers                    |        0 | live                | 2019-12-04 20:14:50
  containers                    |    44772 | 1202311785298792448 | 2019-12-04 20:14:50
  dnsConfig                     |        0 | live                | 2019-12-04 20:14:50
  dnsConfig                     |       32 | 1202311785298792448 | 2019-12-04 20:14:50
  dnsPolicy                     |    44772 | 1202311785298792448 | 2019-12-04 20:14:50
  dnsPolicy                     |        0 | live                | 2019-12-04 20:14:50
  enableServiceLinks            |    26592 | 1202311785298792448 | 2019-12-04 20:14:50
  enableServiceLinks            |        0 | live                | 2019-12-04 20:14:50
  ephemeralContainers           |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  ephemeralContainers           |        0 | live                | 2019-12-04 20:14:50
  hostAliases                   |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  hostAliases                   |        0 | live                | 2019-12-04 20:14:50
  hostIPC                       |        0 | live                | 2019-12-04 20:14:50
  hostIPC                       |       64 | 1202311785298792448 | 2019-12-04 20:14:50
  hostname                      |      260 | 1202311785298792448 | 2019-12-04 20:14:50
  hostname                      |        0 | live                | 2019-12-04 20:14:50
  hostNetwork                   |     6296 | 1202311785298792448 | 2019-12-04 20:14:50
  hostNetwork                   |        0 | live                | 2019-12-04 20:14:50
  hostPID                       |        0 | live                | 2019-12-04 20:14:50
  hostPID                       |       64 | 1202311785298792448 | 2019-12-04 20:14:50
  imagePullSecrets              |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  imagePullSecrets              |        0 | live                | 2019-12-04 20:14:50
  initContainers                |     3944 | 1202311785298792448 | 2019-12-04 20:14:50
  initContainers                |        0 | live                | 2019-12-04 20:14:50
  nodeName                      |    18476 | 1202311785298792448 | 2019-12-04 20:14:50
  nodeName                      |        0 | live                | 2019-12-04 20:14:50
  nodeSelector                  |     2252 | 1202311785298792448 | 2019-12-04 20:14:50
  nodeSelector                  |        0 | live                | 2019-12-04 20:14:50
  overhead                      |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  overhead                      |        0 | live                | 2019-12-04 20:14:50
  preemptionPolicy              |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  preemptionPolicy              |        0 | live                | 2019-12-04 20:14:50
  priority                      |      180 | 1202311785298792448 | 2019-12-04 20:14:50
  priority                      |        0 | live                | 2019-12-04 20:14:50
  priorityClassName             |        0 | live                | 2019-12-04 20:14:50
  priorityClassName             |      128 | 1202311785298792448 | 2019-12-04 20:14:50
  readinessGates                |        0 | live                | 2019-12-04 20:14:50
  readinessGates                |       32 | 1202311785298792448 | 2019-12-04 20:14:50
  restartPolicy                 |    44772 | 1202311785298792448 | 2019-12-04 20:14:50
  restartPolicy                 |        0 | live                | 2019-12-04 20:14:50
  runtimeClassName              |        0 | live                | 2019-12-04 20:14:50
  runtimeClassName              |      184 | 1202311785298792448 | 2019-12-04 20:14:50
  schedulerName                 |    44772 | 1202311785298792448 | 2019-12-04 20:14:50
  schedulerName                 |        0 | live                | 2019-12-04 20:14:50
  securityContext               |        0 | live                | 2019-12-04 20:14:50
  securityContext               |    44772 | 1202311785298792448 | 2019-12-04 20:14:50
  serviceAccount                |     5244 | 1202311785298792448 | 2019-12-04 20:14:50
  serviceAccount                |        0 | live                | 2019-12-04 20:14:50
  serviceAccountName            |     5244 | 1202311785298792448 | 2019-12-04 20:14:50
  serviceAccountName            |        0 | live                | 2019-12-04 20:14:50
  shareProcessNamespace         |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  shareProcessNamespace         |        0 | live                | 2019-12-04 20:14:50
  subdomain                     |        0 | live                | 2019-12-04 20:14:50
  subdomain                     |      260 | 1202311785298792448 | 2019-12-04 20:14:50
  terminationGracePeriodSeconds |    44772 | 1202311785298792448 | 2019-12-04 20:14:50
  terminationGracePeriodSeconds |        0 | live                | 2019-12-04 20:14:50
  tolerations                   |      180 | 1202311785298792448 | 2019-12-04 20:14:50
  tolerations                   |        0 | live                | 2019-12-04 20:14:50
  topologySpreadConstraints     |        0 | live                | 2019-12-04 20:14:50
  topologySpreadConstraints     |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  volumes                       |    27044 | 1202311785298792448 | 2019-12-04 20:14:50
  volumes                       |        0 | live                | 2019-12-04 20:14:50
 (68 rows)

 :end:

*** 495: full_podspec_field_coverage
    :PROPERTIES:
    :header-args:sql-mode+: :tangle ../apps/hasura/migrations/495_full_podspec_field_coverage.up.sql
    :END:
    And we can create a view from this
    #+NAME: full_podspec_field_coverage
    #+BEGIN_SRC sql-mode
     CREATE OR REPLACE VIEW "public"."full_podspec_field_coverage" AS
      select * from full_podspec_field_coverage_material;
    #+END_SRC
   
   
    When using the view, you will want ot make sure to limit it by a job, otherwise you'll get massive results.
   
    for example


     #+begin_src sql-mode :results replace code :wrap EXAMPLE
     \d+ full_podspec_field_coverage;
     #+end_src

     #+RESULTS:
     #+begin_EXAMPLE
                        View "public.full_podspec_field_coverage"
        Column   |  Type   | Collation | Nullable | Default | Storage  | Description 
     ------------+---------+-----------+----------+---------+----------+-------------
      kind       | text    |           |          |         | extended | 
      sub_kind   | text    |           |          |         | extended | 
      field_path | text    |           |          |         | extended | 
      distance   | integer |           |          |         | plain    | 
      test_hits  | bigint  |           |          |         | plain    | 
      conf_hits  | bigint  |           |          |         | plain    | 
      field_kind | text    |           |          |         | extended | 
      job        | text    |           |          |         | extended | 
      bucket     | text    |           |          |         | extended | 
     View definition:
      SELECT full_podspec_field_coverage_material.kind,
         full_podspec_field_coverage_material.sub_kind,
         full_podspec_field_coverage_material.field_path,
         full_podspec_field_coverage_material.distance,
         full_podspec_field_coverage_material.test_hits,
         full_podspec_field_coverage_material.conf_hits,
         full_podspec_field_coverage_material.field_kind,
         full_podspec_field_coverage_material.job,
         full_podspec_field_coverage_material.bucket
        FROM full_podspec_field_coverage_material;

     #+end_EXAMPLE
    #+name: kind_field_coverage_nolive
    #+begin_src sql-mode
      CREATE OR REPLACE VIEW "public"."kind_field_path_coverage" AS
       select * from kind_field_path_coverage_material where job != 'live';
      refresh materialized view kind_field_path_coverage_material; 
    #+end_src
    #+name: full_podspec_field_coverage_nolive
    #+begin_src sql-mode
      CREATE OR REPLACE VIEW "public"."full_podspec_field_path_coverage" AS
       select * from kind_field_path_coverage_material where job != 'live';
      refresh materialized view full_podspec_field_path_coverage_material; 
    #+end_src

   
